balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1784.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONB" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCONB0" edc:desc="" edc:mask="0x1" edc:name="ODCONB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB1" edc:desc="" edc:mask="0x1" edc:name="ODCONB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB2" edc:desc="" edc:mask="0x1" edc:name="ODCONB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB3" edc:desc="" edc:mask="0x1" edc:name="ODCONB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB4" edc:desc="" edc:mask="0x1" edc:name="ODCONB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB5" edc:desc="" edc:mask="0x1" edc:name="ODCONB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB6" edc:desc="" edc:mask="0x1" edc:name="ODCONB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONB7" edc:desc="" edc:mask="0x1" edc:name="ODCONB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ODCONB" edc:desc="" edc:mask="0xff" edc:name="ODCONB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONC" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCONC0" edc:desc="" edc:mask="0x1" edc:name="ODCONC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC1" edc:desc="" edc:mask="0x1" edc:name="ODCONC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC2" edc:desc="" edc:mask="0x1" edc:name="ODCONC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC3" edc:desc="" edc:mask="0x1" edc:name="ODCONC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC4" edc:desc="" edc:mask="0x1" edc:name="ODCONC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC5" edc:desc="" edc:mask="0x1" edc:name="ODCONC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC6" edc:desc="" edc:mask="0x1" edc:name="ODCONC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONC7" edc:desc="" edc:mask="0x1" edc:name="ODCONC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ODCONC" edc:desc="" edc:mask="0xff" edc:name="ODCONC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCOND" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCOND0" edc:desc="" edc:mask="0x1" edc:name="ODCOND0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND1" edc:desc="" edc:mask="0x1" edc:name="ODCOND1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND2" edc:desc="" edc:mask="0x1" edc:name="ODCOND2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND3" edc:desc="" edc:mask="0x1" edc:name="ODCOND3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND4" edc:desc="" edc:mask="0x1" edc:name="ODCOND4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND5" edc:desc="" edc:mask="0x1" edc:name="ODCOND5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND6" edc:desc="" edc:mask="0x1" edc:name="ODCOND6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCOND7" edc:desc="" edc:mask="0x1" edc:name="ODCOND7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ODCOND" edc:desc="" edc:mask="0xff" edc:name="ODCOND" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ODCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ODCONE" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCONE0" edc:desc="" edc:mask="0x1" edc:name="ODCONE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONE1" edc:desc="" edc:mask="0x1" edc:name="ODCONE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCONE2" edc:desc="" edc:mask="0x1" edc:name="ODCONE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ODCONE" edc:desc="" edc:mask="0x7" edc:name="ODCONE" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:Module_ref edc:begin="0x0" edc:end="0x3" edc:modsrc="DOS-CCPx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x3" edc:modsrc="DOS-CCPx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="5"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONA" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONA0" edc:desc="" edc:mask="0x1" edc:name="SLRCONA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA1" edc:desc="" edc:mask="0x1" edc:name="SLRCONA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA2" edc:desc="" edc:mask="0x1" edc:name="SLRCONA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA3" edc:desc="" edc:mask="0x1" edc:name="SLRCONA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA4" edc:desc="" edc:mask="0x1" edc:name="SLRCONA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA5" edc:desc="" edc:mask="0x1" edc:name="SLRCONA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA6" edc:desc="" edc:mask="0x1" edc:name="SLRCONA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA7" edc:desc="" edc:mask="0x1" edc:name="SLRCONA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONA" edc:desc="" edc:mask="0xff" edc:name="SLRCONA" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONB" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONB0" edc:desc="" edc:mask="0x1" edc:name="SLRCONB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB1" edc:desc="" edc:mask="0x1" edc:name="SLRCONB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB2" edc:desc="" edc:mask="0x1" edc:name="SLRCONB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB3" edc:desc="" edc:mask="0x1" edc:name="SLRCONB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB4" edc:desc="" edc:mask="0x1" edc:name="SLRCONB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB5" edc:desc="" edc:mask="0x1" edc:name="SLRCONB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB6" edc:desc="" edc:mask="0x1" edc:name="SLRCONB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB7" edc:desc="" edc:mask="0x1" edc:name="SLRCONB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONB" edc:desc="" edc:mask="0xff" edc:name="SLRCONB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONC" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONC0" edc:desc="" edc:mask="0x1" edc:name="SLRCONC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC1" edc:desc="" edc:mask="0x1" edc:name="SLRCONC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC2" edc:desc="" edc:mask="0x1" edc:name="SLRCONC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC3" edc:desc="" edc:mask="0x1" edc:name="SLRCONC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC4" edc:desc="" edc:mask="0x1" edc:name="SLRCONC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC5" edc:desc="" edc:mask="0x1" edc:name="SLRCONC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC6" edc:desc="" edc:mask="0x1" edc:name="SLRCONC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC7" edc:desc="" edc:mask="0x1" edc:name="SLRCONC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONC" edc:desc="" edc:mask="0xff" edc:name="SLRCONC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCOND" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCOND0" edc:desc="" edc:mask="0x1" edc:name="SLRCOND0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND1" edc:desc="" edc:mask="0x1" edc:name="SLRCOND1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND2" edc:desc="" edc:mask="0x1" edc:name="SLRCOND2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND3" edc:desc="" edc:mask="0x1" edc:name="SLRCOND3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND4" edc:desc="" edc:mask="0x1" edc:name="SLRCOND4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND5" edc:desc="" edc:mask="0x1" edc:name="SLRCOND5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND6" edc:desc="" edc:mask="0x1" edc:name="SLRCOND6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCOND7" edc:desc="" edc:mask="0x1" edc:name="SLRCOND7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCOND" edc:desc="" edc:mask="0xff" edc:name="SLRCOND" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SLRCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SLRCONE" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONE0" edc:desc="" edc:mask="0x1" edc:name="SLRCONE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONE1" edc:desc="" edc:mask="0x1" edc:name="SLRCONE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONE2" edc:desc="" edc:mask="0x1" edc:name="SLRCONE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONE" edc:desc="" edc:mask="0x7" edc:name="SLRCONE" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
