balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1784.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEP" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEP" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEP3" edc:desc="" edc:mask="0x1" edc:name="IOCEP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEN" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEN" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEN3" edc:desc="" edc:mask="0x1" edc:name="IOCEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEF" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:desc="" edc:mask="0x1" edc:name="IOCEF3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="20"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-OPAMP_amp_opamp_hvpump_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-OPAMP_amp_opamp_hvpump_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00110000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="00110000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:desc="" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:desc="" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRSLR" edc:desc="" edc:mask="0x1" edc:name="CLKRSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKROE" edc:desc="" edc:mask="0x1" edc:name="CLKROE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV" edc:desc="" edc:mask="0x7" edc:name="CLKRDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CLKRDC" edc:desc="" edc:mask="0x3" edc:name="CLKRDC" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x870" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x5"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0xd"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x1d"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
        </edc:Module_ref>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xda0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xea0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
